src/cf/BusinessProcesses/ЗаявкаНаИзменение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<BusinessProcess>
		<Properties>
			<Name>ЗаявкаНаИзменение</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявкиНаИзменение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммныйПродукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммныеПродукты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеОбращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Техлид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановыеТрудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/cf/Enums/СтатусыЗаявкиНаИзменение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявкиНаИзменение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АналитическаяПроработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкаТрудозатрат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеДоработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоработкаНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоработкаНеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тестирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеЗапросаНаСлияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаКода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРаботЗаказчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/BusinessProcesses/ЗаявкаНаИзменение/Ext/ObjectModule.bsl
Процедура ДоработкаТребуетсяПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Статус <> Перечисления.СтатусыЗаявкиНаИзменение.ДоработкаНеТребуется;
КонецПроцедуры

Процедура ДоработкаСогласованаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Статус <> Перечисления.СтатусыЗаявкиНаИзменение.ДоработкаНеСогласована;
КонецПроцедуры

Процедура ЗамечанияОтАналитикаЕстьПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Статус = Перечисления.СтатусыЗаявкиНаИзменение.ВРазработке;
КонецПроцедуры

Процедура ЗамечанияОтТехлидаЕстьПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Статус = Перечисления.СтатусыЗаявкиНаИзменение.ВРазработке;
КонецПроцедуры

Процедура УточнитьПостановкуЗадачиПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если Статус = Перечисления.СтатусыЗаявкиНаИзменение.ВРазработке 
		И НЕ ЗначениеЗаполнено(Описание) Тогда
		ВызватьИсключение "Не заполнено описание";
	КонецЕсли;
	Если Аналитик <> ПараметрыСеанса.ТекущийПользователь Тогда
		Аналитик = ПараметрыСеанса.ТекущийПользователь;
		Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОценитьТрудозатратыПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ЗначениеЗаполнено(ПлановыеТрудозатраты) Тогда
		ВызватьИсключение "Не заполнены плановые трудозатраты";
	КонецЕсли;
	Если Техлид <> ПараметрыСеанса.ТекущийПользователь Тогда
		Техлид = ПараметрыСеанса.ТекущийПользователь;
		Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьДоработкуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если Программист <> ПараметрыСеанса.ТекущийПользователь Тогда
		Программист = ПараметрыСеанса.ТекущийПользователь;
		Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьКодПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Если ЗначениеЗаполнено(Техлид) Тогда
		Для Каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
			ЗадачаОбъект.Исполнитель = Техлид;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОценитьТрудозатратыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Если ЗначениеЗаполнено(Техлид) Тогда
		Для Каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
			ЗадачаОбъект.Исполнитель = Техлид;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура СогласоватьДоработкуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Если ЗначениеЗаполнено(Акцептант) Тогда
		Для Каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
			ЗадачаОбъект.Исполнитель = Акцептант;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьДоработкуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Если ЗначениеЗаполнено(Программист) Тогда
		Для Каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
			ЗадачаОбъект.Исполнитель = Программист;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПротестироватьДоработкуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
		ЗадачаОбъект.Исполнитель = Аналитик;
	КонецЦикла;
КонецПроцедуры

Процедура СозданиеЗапросаНаСлияниеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
		ЗадачаОбъект.Исполнитель = Программист;
	КонецЦикла;
КонецПроцедуры

Процедура СдатьРаботуЗаказчикуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
		ЗадачаОбъект.Исполнитель = Аналитик;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда
		Если НЕ ЗначениеЗаполнено(Статус) Тогда
			Статус = БизнесПроцессы.ЗаявкаНаИзменение.ДоступныеСтатусы(Статус)[0];
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
